Repository: wiomoc/pretix-sumup-payment
Catalog: pretix_sumup/locale/*/LC_MESSAGES/django.po
Languages: de

source: Accept credit card payments via SumUp
de: Akzeptieren Sie Kreditkartenzahlungen über SumUp

source: Credit card via SumUp
de: Kreditkarte über SumUp

source: Credit card
de: Kreditkarte

source: API Key
de: API Schlüssel

source: API keys are authorization tokens that allow pretix to call SumUp on your behalf. <a href="https://developer.sumup.com/api-keys" target="_blank">Click here to manage API Keys in SumUp</a>
de: API Schlüssel sind Autorisierungstoken, die es pretix erlauben SumUp in Ihrem Namen aufzurufen. <a href="https://developer.sumup.com/api-keys" target="_blank">Klicken sie hier um API Schlüssel in SumUp zu verwalten</a>

source: Automatically filled in
de: Wird automatisch ausgefüllt

source: Merchant Code
de: Kundennummer

source: Enable Alternative Payment Methods
de: Alternative Zahlungsmöglichkeiten aktivieren

source: Allow customers to pay using alternative payment methods like Apple Pay, Google Pay, iDEAL. <br><i>The supported payment methods depend on the country of your SumUp account. </i><i><a href="https://developer.sumup.com/online-payments/apm/introduction" target="_blank">Learn more</a></i> <br><br><i>In order to enable Apple Pay:</i><br><i>1. Download the Domain verification file from <a href="https://developer.sumup.com/settings/wallets/apple-pay?tab=web" target="_blank">SumUp Wallets Settings</a> and open it with a text editor</i><br><i>2. Copy and paste the whole file as text to the "ApplePay MerchantID Domain Association" field under Pretix's "Global settings" (only accessible as an Admin user via "Admin mode")</i><br><i>3. Verify your domain by pasting it to <a href="https://developer.sumup.com/settings/wallets" target="_blank">SumUp Wallets Settings</a> and clicking "Check domain" (like "example.com" or "world.example.com")</i><br>
de: Ermöglichen Sie Ihren Kunden, mit alternativen Zahlungsmethoden wie Apple Pay, Google Pay, iDEAL zu bezahlen. <br><i>Die unterstützten Zahlungsmethoden hängen von dem Land Ihres SumUp-Kontos ab.<br><i><a href="https://developer.sumup.com/online-payments/apm/introduction" target="_blank">Mehr Informationen</a></i><br><br><i>Um Apple Pay zu aktivieren:</i><br><i>1. Laden Sie die Domain Verifizierungsdatei von <a href="https://developer.sumup.com/settings/wallets/apple-pay?tab=web" target="_blank">SumUp Wallets Settings</a> herunter und öffnen Sie sie mit einem Texteditor</i><br><i>2. Kopieren Sie die gesamte Datei und fügen Sie sie als Text in das Feld "ApplePay MerchantID Domain Association" unter Pretix' "Globale Einstellungen" (nur als Admin-Benutzer über "Admin-Modus" zugänglich)</i><br><i>3. Überprüfen Sie Ihre Domain, indem Sie sie in <a href="https://developer.sumup.com/settings/wallets" target="_blank">SumUp Wallets Settings</a> und auf "Check domain" (wie "example.com" oder "world.example.com")</i><br>

source: Enable Google Pay
de: Google Pay aktivieren

source: Allow customers to pay using Google Pay.<br><br><i>Follow these steps to enable Google Pay:</i><br><i>1. Register a Google Pay business account at <a href="https://pay.google.com/business/console/" target="_blank">Google Pay for Business</a></i><br><i>2. Fill out your information under the "Business profile" tab and get it approved by Google</i><br><i>3. Enable Google Pay here and fill in your Google Merchant ID (found next to your business name on the Google Pay console)</i><br><i>4. In Google Pay console's "Google Pay API" tab, fill in your domain and choose "Gateway" as Integration type</i><br><i>5. Take screenshots of your Pretix store and submit them to Google. For test screens, add:</i> <code>#sumup-widget:google-pay-demo-mode</code> <i>to the end of your payment URL</i><br><i>6. After Google approves your implementation (usually within 48h), contact SumUp's Integration Team to activate Google Pay through the <a href="https://developer.sumup.com/contact" target="_blank">SumUp contact form</a>, providing your SumUp Merchant Code, Email, and a test ticket shop URL</i><br><br><i>For more detailed instructions and example screenshots, please visit the <a href="https://github.com/wiomoc/pretix-sumup-payment" target="_blank">project's GitHub repository</a>.</i>
de: Erlauben Sie Kunden, mit Google Pay zu bezahlen.<br><br><i>Folgen Sie diesen Schritten, um Google Pay zu aktivieren:</i><br><i>1. Registrieren Sie ein Google Pay-Geschäftskonto bei <a href="https://pay.google.com/business/console/" target="_blank">Google Pay for Business</a></i><br><i>2. Füllen Sie Ihre Informationen unter der Registerkarte "Geschäftsprofil" aus und lassen Sie sie von Google genehmigen</i><br><i>3. Aktivieren Sie Google Pay hier und geben Sie Ihre Google Merchant ID ein (diese finden Sie neben Ihrem Unternehmensnamen in der Google Pay-Konsole)</i><br><i>4. Geben Sie in der Google Pay Konsole auf der Registerkarte "Google Pay API" Ihre Domain ein und wählen Sie "Gateway" als Integrationstyp</i><br><i>5. Machen Sie Screenshots von Ihrem Pretix-Shop und senden Sie sie an Google. Für Testbildschirme fügen Sie:</i> <code>#sumup-widget:google-pay-demo-mode</code> <i>an das Ende Ihrer Zahlungs-URL</i><br><i>6. Nachdem Google Ihre Implementierung genehmigt hat (in der Regel innerhalb von 48h), kontaktieren Sie das Integrationsteam von SumUp, um Google Pay über die <a href="https://developer.sumup. com/contact" target="_blank">SumUp contact form</a> zu aktivieren. Geben Sie dabei Ihren SumUp Merchant Code, Ihre E-Mail und eine Test-Ticket-Shop URL</i><br><br><i>Für detailliertere Anweisungen und Beispiel-Screenshots, besuchen Sie bitte das <a href="https://github.com/wiomoc/pretix-sumup-payment" target="_blank">Projekt GitHub Repository</a>.</i>

source: The Merchant ID for Google Pay. Must be between 12-18 characters long.
de: Die Merchant ID für Google Pay. Sie muss zwischen 12 und 18 Zeichen lang sein.

source: Invalid API key: {}
de: Ungültiger API-Schlüssel: {}

source: Google Pay requires Alternative Payment Methods to be enabled first.
de: Für Google Pay müssen zunächst alternative Zahlungsmethoden aktiviert werden.

source: Google Pay Merchant ID is required when Google Pay is enabled.
de: Die Google Pay-Händler-ID ist erforderlich, wenn Google Pay aktiviert ist.

source: Merchant Name is required when Google Pay is enabled. Please input your API key again in order to retrieve your Merchant Name.
de: Der Händlername ist erforderlich, wenn Google Pay aktiviert ist. Bitte geben Sie Ihren API-Schlüssel erneut ein, um Ihren Händlernamen abzurufen.

source: Error while creating SumUp checkout
de: Fehler beim Erstellen des SumUp Checkouts

source: After confirmation you will be redirected to SumUp to complete the payment.
de: Nach Bestätigung werden Sie zu SumUp weitergeleitet, um die Zahlung abzuschließen.

source: Error while refunding SumUp transaction
de: Fehler beim Erstatten der SumUp Transaktion

source: Payed via SumUp {} Auth code: {}
de: Bezahlt via SumUp {} Autorisierungscode: {}

source: Error while synchronizing SumUp checkout
de: Fehler beim Synchronisieren des SumUp Checkouts

source: No API Key given.
de: Kein API Key angegeben.

source: Could not contact SumUp.
de: SumUp konnte nicht kontaktiert werden.

source: The API Key is invalid.
de: Der API Key ist ungültig.

source: SumUp Receipt
de: SumUp Beleg

source: Processing payment
de: Bearbeite Zahlung

source: Last try rejected. Please check your entry and retry afterwards.
de: Der letzte Versuch die Zahlung durchzuführen wurde abgelehnt. Bitte überprüfen Sie ihre Daten und versuchen es erneut.

source: Invalid card data. Please check your entry and retry afterwards.
de: Ihre Kartendaten sind unzulässig. Bitte überprüfen Sie diese und versuchen es danach erneut.

source: Sorry, there was an error in the payment process. Please check the link in your emails to continue.
de: Entschuldigung, es ist ein Fehler beim Zahlungsvorgang aufgetreten. Bitte überprüfen Sie den Link in Ihren E-Mails, um fortzufahren.
