Repository: wiomoc/pretix-sumup-payment
Catalog: pretix_sumup/locale/*_Informal/LC_MESSAGES/django.po
Languages: de

source: Accept creditcard payments via SumUp
de: Akzeptiere Kreditkartenzahlungen über SumUp

source: Credit card via SumUp
de: Kreditkarte über SumUp

source: Credit card
de: Kreditkarte

source: API Key
de: API Schlüssel

source: API keys are authorization tokens that allow pretix to call SumUp on your behalf. <a href="https://developer.sumup.com/api-keys" target="_blank">Click here to manage API Keys in SumUp</a>
de: API Schlüssel sind Autorisierungstoken, die es pretix erlauben SumUp in deinem Namen aufzurufen. <a href="https://developer.sumup.com/api-keys" target="_blank">Klicke hier um API Schlüssel in SumUp zu verwalten</a>

source: Automatically filled in
de: Wird automatisch ausgefüllt

source: Merchant Code
de: Kundennummer

source: Error while creating sumup checkout
de: Fehler beim Erstellen des SumUp Checkouts

source: After confirmation you will be redirected to SumUp to complete the payment.
de: Nach Bestätigung wirst du zu SumUp weitergeleitet um die Zahlung abzuschließen.

source: Error while refunding sumup transaction
de: Fehler beim Erstatten der SumUp Transaktion

source: Payed via SumUp {} **** **** **** {} Auth code: {}
de: Bezahlt via SumUp {} **** **** **** {} Authentisierungscode: {}

source: Error while synchronizing sumup checkout
de: Fehler beim Synchronisieren des SumUp Checkouts

source: No SumUp checkout ID found.
de: Keine SumUp Checkout ID gefunden.

source: No API Key given.
de: Kein Access Token angegeben.

source: The API Key is invalid.
de: Der API Key ist ungültig.

source: Processing Payment
de: Bearbeite Zahlung

source: Last try rejected. Please check your entry and retry afterwards.
de: Der letzte Versuch die Zahlung durchzuführen wurde abgelehnt. Bitte überprüfe deine Daten und versuche es danach erneut.

source: Payment successful
de: Bezahlung erfolgreich

source: Invalid card data. Please check your entry and retry afterwards.
de: Deine Kartendaten sind unzulässig. Bitte überprüfe diese und versuche es danach erneut.
